app/controllers/api/v1/auth/sessions_controller.rb

        def respond_with(resource, _opts = {})
          @message   = "Inicio de sesión exitoso"
          @auth_user = User.includes(:area, area_memberships: :area).find(resource.id)
---
SELECT "areas".* FROM "areas" WHERE "areas"."id" = 7
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1