app/views/api/v1/users/_user.json.jbuilder

SELECT "area_memberships".* FROM "area_memberships" WHERE "area_memberships"."user_id" = 6 AND "area_memberships"."area_id" = 9 LIMIT 1
---
if user.association(:area_memberships).loaded?
  active_membership = user.area_memberships
                          .select { |m| m.is_active && m.area_id == user.area_id }
                          .first