app/controllers/api/v1/admin_virtual_submissions_controller.rb

      def show
        @submission = VirtualSubmission.includes(*SUBMISSION_INCLUDES).find(params[:id])
---
SELECT "virtual_submissions".* FROM "virtual_submissions" WHERE "virtual_submissions"."id" = 8 LIMIT 1

      def update_status
        @submission = VirtualSubmission.includes(*SUBMISSION_INCLUDES).find(params[:id])
        authorize @submission
        from_status  = @submission.status
        from_area_id = @submission.to_area_id
        new_status   = params[:status]

        attrs = { status: new_status, review_notes: params[:review_notes] }

        if new_status == "derivado"
          unless params[:to_area_id].present?
            return render json: { error: "Debe seleccionar el área destinataria para derivar el trámite" },
                          status: :unprocessable_entity
          end
          attrs[:to_area_id] = params[:to_area_id]
        end

        if @submission.update(attrs)
          @submission.flows.create!(
            action:       new_status,
            from_status:  from_status.to_s,
            to_status:    new_status,
            from_area_id: from_area_id,
            to_area_id:   new_status == "derivado" ? params[:to_area_id].to_i : nil,
            performed_by: current_user,
            notes:        params[:review_notes],
            performed_at: Time.current
          )

          @submission = VirtualSubmission.includes(*SUBMISSION_INCLUDES).find(@submission.id)
---
SELECT "virtual_submissions".* FROM "virtual_submissions" WHERE "virtual_submissions"."id" = 8 LIMIT 1
UPDATE "virtual_submissions" SET "status" = 3, "review_notes" = 'que lo revise informatica', "updated_at" = '2026-06-21 12:18:35.828555', "to_area_id" = 8 WHERE "virtual_submissions"."id" = 8
INSERT INTO "virtual_submission_flows" ("virtual_submission_id", "from_area_id", "to_area_id", "performed_by_id", "action", "from_status", "to_status", "notes", "performed_at", "created_at", "updated_at") VALUES (8, NULL, NULL, 2, 'en_revision', 'registrado', 'en_revision', 'porfin a revisar', '2026-06-21 12:17:56.396424', '2026-06-21 12:17:56.397487', '2026-06-21 12:17:56.397487') RETURNING "id"
SELECT "areas".* FROM "areas" WHERE "areas"."id" = 8