app/controllers/api/v1/areas_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IN (4, 2)
SELECT "areas".* FROM "areas" WHERE "areas"."parent_id" IN (1, 2, 3, 4, 5, 6, 7, 8, 9)
---
      def index
        authorize Area
        @areas = Area.kept.includes(:parent, :children, area_memberships: :user)

INSERT INTO "areas" ("archive_type", "area_type", "created_at", "description", "discarded_at", "name", "parent_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT "areas".* FROM "areas" WHERE "areas"."id" = 1
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
---
      def create
        authorize Area
        @area = Area.new(area_params)

        if @area.save
          @area = Area.includes(:parent, :children, area_memberships: :user).find(@area.id)

UPDATE "areas" SET "name" = $1, "updated_at" = $2 WHERE "areas"."id" = $3  [["name", "Nombre Actualizado"], ["updated_at", "2026-06-16 16:43:33.279126"], ["id", 83]]
SELECT "areas".* FROM "areas" WHERE "areas"."id" = $1 LIMIT $2  [["id", 83], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]
---
      def update
        authorize @area
        if @area.update(area_params)
          @area = Area.includes(:parent, :children, area_memberships: :user).find(@area.id)

SELECT "area_memberships".* FROM "area_memberships" WHERE "area_memberships"."area_id" = 2
---
      def members
        authorize @area
        @memberships = @area.area_memberships.includes(:user, :area)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 46], ["LIMIT", 1]]
SELECT "area_memberships".* FROM "area_memberships" WHERE "area_memberships"."area_id" = $1 AND "area_memberships"."user_id" = $2 LIMIT $3  [["area_id", 86], ["user_id", 181], ["LIMIT", 1]]
SELECT "area_memberships".* FROM "area_memberships" WHERE "area_memberships"."area_id" = 2
SELECT "areas".* FROM "areas" WHERE "areas"."id" = 1 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 5
---
      def add_member
        authorize @area, :update?
        user = User.find(params[:user_id])
        membership = @area.area_memberships.find_or_initialize_by(user: user)
        membership.position_role = params[:position_role].presence || "soporte"
        membership.is_active = true

        if membership.save
          @membership = membership.reload
          @membership = AreaMembership.includes(:user, :area).find(@membership.id)

SELECT "area_memberships".* FROM "area_memberships" WHERE "area_memberships"."area_id" = 2
---
      def remove_member
        authorize @area, :update?
        membership = @area.area_memberships.find(params[:membership_id])

SELECT "areas".* FROM "areas" WHERE "areas"."id" = 2 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 5
---
      def set_area
        @area = Area.includes(:parent, :children, area_memberships: :user).find(params[:id])