app/controllers/api/v1/digital_certificates_controller.rb

      def set_default
        current_user.digital_certificates.kept.update_all(is_default: false)
---
UPDATE "digital_certificates" SET "is_default" = $1 WHERE "digital_certificates"."user_id" = $2 AND "digital_certificates"."discarded_at" IS NULL AND "digital_certificates"."id" != $3  [["is_default", false], ["user_id", 257], ["id", 32]]