app/controllers/api/v1/document_types_controller.rb

      def show
        @document_type = DocumentType.find(params[:id])
---
SELECT "document_types".* FROM "document_types" WHERE "document_types"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]

      def create
        authorize DocumentType
        @document_type = DocumentType.new(document_type_params)
        if @document_type.save
---
INSERT INTO "document_types" ("code", "created_at", "description", "is_active", "name", "retention_years", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

      def update
        @document_type = DocumentType.find(params[:id])
        authorize @document_type
        if @document_type.update(document_type_params)
---
SELECT "document_types".* FROM "document_types" WHERE "document_types"."id" = $1 LIMIT $2  [["id", 100], ["LIMIT", 1]]
UPDATE "document_types" SET "name" = $1, "updated_at" = $2 WHERE "document_types"."id" = $3  [["name", "Nuevo Nombre"], ["updated_at", "2026-06-16 16:43:33.771257"], ["id", 100]]

      def destroy
        type = DocumentType.find(params[:id])
        authorize type
        type.update!(is_active: false)
---
SELECT "document_types".* FROM "document_types" WHERE "document_types"."id" = $1 LIMIT $2  [["id", 34], ["LIMIT", 1]]
UPDATE "document_types" SET "is_active" = $1, "updated_at" = $2 WHERE "document_types"."id" = $3  [["is_active", false], ["updated_at", "2026-06-16 16:31:30.651775"], ["id", 34]]