app/controllers/api/v1/documents_controller.rb

      def create
        authorize Document
        @document = Document.new(document_params)
        @document.created_by = current_user

        if @document.save
          attach_files(@document) if params[:attachments].present?

          DocumentFlow.create!(
            document:     @document,
            performed_by: current_user,
            action:       "registrado",
            from_status:  nil,
            to_status:    "registrado",
            to_area:      @document.area
          )

          @document = Document.includes(*DOCUMENT_INCLUDES).find(@document.id)
---
INSERT INTO "documents" ("document_type_id", "area_id", "created_by_id", "subject", "sender", "recipient", "priority", "status", "observations", "document_number", "received_at", "due_date", "created_at", "updated_at") VALUES (9, 1, 2, 'solicitud de compra de mteriales', 'Pedro Olano', 'Ruben Carpio', 2, 0, 'testtssd', 'TD-2026-0001', '2026-06-15 04:03:01.628052', '2026-06-17', '2026-06-15 04:03:01.631273', '2026-06-15 04:03:01.631273') RETURNING "id"
INSERT INTO "document_flows" ("action", "created_at", "document_id", "from_area_id", "from_status", "observations", "performed_at", "performed_by_id", "to_area_id", "to_status", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
INSERT INTO "documents" ("document_type_id", "area_id", "created_by_id", "subject", "sender", "recipient", "priority", "status", "observations", "document_number", "received_at", "due_date", "created_at", "updated_at") VALUES (1, 8, 2, 'test', 'ramiro', 'ortencio', 3, 0, NULL, 'TD-2026-0003', '2026-06-15 23:14:54.494985', '2026-07-11', '2026-06-15 23:14:54.499439', '2026-06-15 23:14:54.499439') RETURNING "id"
SELECT "documents".* FROM "documents" WHERE "documents"."id" = $1 LIMIT $2  [["id", 47], ["LIMIT", 1]]
SELECT "areas".* FROM "areas" WHERE "areas"."id" = 8 LIMIT 1

      def update
        authorize @document
        if @document.update(document_params)
          attach_files(@document) if params[:attachments].present?
          @document = Document.includes(*DOCUMENT_INCLUDES).find(@document.id)
---
UPDATE "documents" SET "subject" = $1, "updated_at" = $2 WHERE "documents"."id" = $3  [["subject", "Updated subject"], ["updated_at", "2026-06-16 16:43:34.049225"], ["id", 48]]
SELECT "documents".* FROM "documents" WHERE "documents"."id" = $1 LIMIT $2  [["id", 48], ["LIMIT", 1]]

      def destroy
        authorize @document
        @document.update!(status: :anulado)
---
UPDATE "documents" SET "status" = $1, "updated_at" = $2 WHERE "documents"."id" = $3  [["status", 5], ["updated_at", "2026-06-16 16:31:31.295144"], ["id", 14]]

      def update_status
        authorize @document
        old_status = @document.status

        if @document.update(status: params[:status])
          DocumentFlow.create!(
            document:     @document,
            performed_by: current_user,
            action:       params[:status],
            from_status:  old_status,
            to_status:    params[:status],
            from_area:    @document.area,
            observations: params[:observations]
          )

          @document = Document.includes(*DOCUMENT_INCLUDES).find(@document.id)
---
UPDATE "documents" SET "status" = 1, "updated_at" = '2026-06-15 23:56:33.149475' WHERE "documents"."id" = 4
INSERT INTO "document_flows" ("action", "created_at", "document_id", "from_area_id", "from_status", "observations", "performed_at", "performed_by_id", "to_area_id", "to_status", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
SELECT "documents".* FROM "documents" WHERE "documents"."id" = 4 LIMIT 1
SELECT "areas".* FROM "areas" WHERE "areas"."id" IN (8, 5, 1)

      def set_document
        @document = Document.includes(*DOCUMENT_INCLUDES).find(params[:id])
---
SELECT "documents".* FROM "documents" WHERE "documents"."id" = 4 LIMIT 1