app/controllers/api/v1/profile_controller.rb

      def show
        @current_user_profile = User.includes(:area, area_memberships: :area).find(current_user.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 73], ["LIMIT", 1]]

      def update
        if current_user.update(profile_params)
          @current_user_profile = User.includes(:area, area_memberships: :area).find(current_user.id)
---
UPDATE "users" SET "apellido" = $1, "nombre" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["apellido", "Nuevo Apellido"], ["nombre", "Nuevo Nombre"], ["updated_at", "2026-06-16 16:43:34.192647"], ["id", 210]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 74], ["LIMIT", 1]]

      def update_password
        unless current_user.valid_password?(params[:current_password])
          return render json: { error: "La contraseña actual es incorrecta" }, status: :unprocessable_entity
        end

        if current_user.update(password: params[:password], password_confirmation: params[:password_confirmation])
---
UPDATE "users" SET "encrypted_password" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["encrypted_password", "[FILTERED]"], ["updated_at", "2026-06-16 16:43:34.228009"], ["id", 213]]