app/controllers/api/v1/role_permissions_controller.rb

      def index
        authorize :role_permission, :index?

        roles = RolePermission.roles
        @permissions = {}
        @roles_meta  = SystemRole.order(:created_at)
---
SELECT "system_roles".* FROM "system_roles" ORDER BY "system_roles"."created_at" ASC

      def update_batch
        authorize :role_permission, :update?

        live_roles = RolePermission.roles
        updates = params.require(:permissions).permit(
          live_roles.index_with { RolePermission::PAGE_KEYS }
        ).to_h

        ActiveRecord::Base.transaction do
          updates.each do |role, pages|
            next unless live_roles.include?(role)
            pages.each do |page_key, allowed|
              next unless RolePermission::PAGE_KEYS.include?(page_key)
              RolePermission.find_or_initialize_by(role: role, page_key: page_key)
                            .update!(allowed: ActiveModel::Type::Boolean.new.cast(allowed))
---
SELECT "role_permissions".* FROM "role_permissions" WHERE "role_permissions"."role" = 'mesadepartes' AND "role_permissions"."page_key" = 'mis_derivados' LIMIT 1
SELECT 1 AS one FROM "role_permissions" WHERE "role_permissions"."role" = $1 AND "role_permissions"."page_key" = $2 LIMIT $3  [["role", "staff"], ["page_key", "[FILTERED]"], ["LIMIT", 1]]
UPDATE "role_permissions" SET "allowed" = TRUE, "updated_at" = '2026-06-21 22:20:53.099709' WHERE "role_permissions"."id" = 52