app/controllers/api/v1/system_roles_controller.rb

SELECT "system_roles".* FROM "system_roles" ORDER BY "system_roles"."created_at" ASC
---
      def index
        authorize :system_role, :index?
        @roles = SystemRole.order(:created_at)

INSERT INTO "system_roles" ("name", "display_name", "color", "bg_color", "is_system", "created_at", "updated_at") VALUES ('mesadepartes', 'Mesa de Partes', '#92400e', '#fef3c7', FALSE, '2026-06-21 13:09:15.864429', '2026-06-21 13:09:15.864429') RETURNING "id"
SELECT "role_permissions".* FROM "role_permissions" WHERE "role_permissions"."role" = 'mesadepartes' AND "role_permissions"."page_key" = 'dashboard' LIMIT 1
INSERT INTO "role_permissions" ("role", "page_key", "allowed", "created_at", "updated_at") VALUES ('mesadepartes', 'dashboard', FALSE, '2026-06-21 13:09:15.880832', '2026-06-21 13:09:15.880832') RETURNING "id"
---
      def create
        authorize :system_role, :create?
        @role = SystemRole.new(role_params)
        if @role.save
          # Auto-create page permissions for the new role — all hidden by default
          RolePermission::PAGE_KEYS.each do |key|
            RolePermission.find_or_create_by!(role: @role.name, page_key: key) do |rp|