app/controllers/api/v1/users_controller.rb

      def index
        authorize User
        @users = User.kept.includes(:area, area_memberships: :area)
---
SELECT "users".* FROM "users" WHERE "users"."id" IN (4, 3, 2, 5, 6)
SELECT "areas".* FROM "areas" WHERE "areas"."id" IN (8, 5)

      def create
        authorize User
        @user = User.new(user_params)
        @user.password = params[:user][:password]
        @user.password_confirmation = params[:user][:password_confirmation]

        if @user.save
          assign_area_membership(@user) if params[:user][:area_id].present?
          @user = User.includes(:area, area_memberships: :area).find(@user.id)
---
INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "nombre", "apellido", "dni", "role", "cargo", "area", "telefono", "discarded_at", "created_at", "updated_at", "area_id") VALUES ('carla@email.com', '$2a$12$qB/VMqLWR6E7oXxIAbmT1.zp1Yl1UJO5zX0/gbVsU.Vj0WR6I8AYm', NULL, NULL, NULL, 'carla', 'taz', '15687564', 1, NULL, NULL, '2374628734623', NULL, '2026-06-21 12:27:59.718006', '2026-06-21 12:27:59.718006', 9) RETURNING "id"
SELECT "areas".* FROM "areas" WHERE "areas"."id" = 9
SELECT "users".* FROM "users" WHERE "users"."id" = 6 LIMIT 1

      def update
        authorize @user
        if @user.update(update_user_params)
          assign_area_membership(@user) if params[:user][:area_id].present?
          @user = User.includes(:area, area_memberships: :area).find(@user.id)
---
UPDATE "users" SET "encrypted_password" = '$2a$12$FhN5sqPoi209LmNdnIQ.bOAgkpjwopST1r.sQruY6sPdpUQ74/NXC', "updated_at" = '2026-06-16 02:14:37.055981' WHERE "users"."id" = 4
SELECT "areas".* FROM "areas" WHERE "areas"."id" = 8 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1

      def update_role
        authorize @user, :update?
        if @user.update(role: params[:role])
---
UPDATE "users" SET "updated_at" = '2026-06-21 13:09:45.260133', "role" = 'mesadepartes' WHERE "users"."id" = 6

      def set_user
        @user = User.includes(:area, area_memberships: :area).find(params[:id])
---
SELECT "areas".* FROM "areas" WHERE "areas"."id" = 8
SELECT "users".* FROM "users" WHERE "users"."id" = 4 LIMIT 1

      def assign_area_membership(user)
        return unless params[:user][:area_id].present?

        membership = user.area_memberships.find_or_initialize_by(area_id: params[:user][:area_id])
        membership.position_role = params[:user][:position_role].presence || membership.position_role || "soporte"
        membership.is_active = true
        membership.save!
---
SELECT "area_memberships".* FROM "area_memberships" WHERE "area_memberships"."user_id" = 6 AND "area_memberships"."area_id" = 9 LIMIT 1
UPDATE "area_memberships" SET "position_role" = 2, "updated_at" = '2026-06-15 23:09:02.331564' WHERE "area_memberships"."id" = 2