app/controllers/api/v1/virtual_submissions_controller.rb

INSERT INTO "virtual_submissions" ("tracking_number", "submitter_type", "submitter_name", "submitter_document", "submitter_email", "submitter_phone", "submitter_address", "company_name", "representative_name", "document_type_id", "subject", "observations", "folio_count", "status", "review_notes", "received_at", "created_at", "updated_at", "to_area_id") VALUES ('VT-2026-4629082', 'natural', 'pedro', '51936987', 'pedro@gmail.com', '234234234', 'casa', NULL, NULL, 6, 'carta', 'test', 1, 0, NULL, '2026-06-21 11:46:39.457114', '2026-06-21 11:46:39.457024', '2026-06-21 11:46:39.457024', NULL) RETURNING "id"
INSERT INTO "virtual_submissions" ("tracking_number", "submitter_type", "submitter_name", "submitter_document", "submitter_email", "submitter_phone", "submitter_address", "company_name", "representative_name", "document_type_id", "subject", "observations", "folio_count", "status", "review_notes", "received_at", "created_at", "updated_at", "to_area_id") VALUES ('VT-2026-5299308', 'natural', 'nemesia chuspe benavente', '23832840', 'nemesia@gmail.com', '159357159', 'casa', NULL, NULL, 1, 'test 4', 'test 4', 1, 0, NULL, '2026-06-16 02:12:42.715210', '2026-06-16 02:12:42.715083', '2026-06-16 02:12:42.715083', NULL) RETURNING "id"
INSERT INTO "virtual_submission_flows" ("virtual_submission_id", "from_area_id", "to_area_id", "performed_by_id", "action", "from_status", "to_status", "notes", "performed_at", "created_at", "updated_at") VALUES (4, NULL, NULL, NULL, 'registrado', NULL, 'registrado', NULL, '2026-06-16 03:13:47.074083', '2026-06-16 03:13:47.212174', '2026-06-16 03:13:47.212174') RETURNING "id"
---
      def create
        @submission = VirtualSubmission.new(submission_params)

        if @submission.save
          attach_files(@submission) if params[:attachments].present?

          @submission.flows.create!(
            action:       "registrado",
            from_status:  nil,
            to_status:    "registrado",
            notes:        nil,
            performed_at: @submission.received_at
          )

SELECT "areas".* FROM "areas" WHERE "areas"."id" IN (2, 8)
SELECT "virtual_submissions".* FROM "virtual_submissions" WHERE "virtual_submissions"."tracking_number" = 'VT-2026-5299308' ORDER BY "virtual_submissions"."created_at" DESC
SELECT "virtual_submissions".* FROM "virtual_submissions" WHERE "virtual_submissions"."submitter_document" = '45603792' ORDER BY "virtual_submissions"."created_at" DESC
---
      def track
        @submissions = if params[:tracking_number].present?
          VirtualSubmission.includes(:document_type, :to_area, flows: [:from_area, :to_area])
                           .where(tracking_number: params[:tracking_number])
        elsif params[:document].present?
          VirtualSubmission.includes(:document_type, :to_area, flows: [:from_area, :to_area])
                           .where(submitter_document: params[:document])