app/controllers/api/v1/virtual_submissions_controller.rb

SELECT "areas".* FROM "areas" WHERE "areas"."id" IN (2, 8)
---
      def track
        base = VirtualSubmission
                 .includes(:document_type, :to_area, flows: [:from_area, :to_area])
                 .with_attached_attachments

        @submissions = if params[:tracking_number].present?
          base.where(tracking_number: params[:tracking_number])
        elsif params[:document].present?
          base.where(submitter_document: params[:document])
        else
          return render json: { error: "Debe proporcionar número de trámite o número de documento" },
                        status: :bad_request
        end

        if @submissions.empty?
          return render json: { error: "No se encontraron trámites con los datos proporcionados" },
                        status: :not_found
        end

        @submissions = @submissions.order(created_at: :desc)