app/models/role_permission.rb

SELECT "system_roles"."name" FROM "system_roles"
---
  def self.roles
    SystemRole.pluck(:name)

SELECT "role_permissions"."page_key" FROM "role_permissions" WHERE "role_permissions"."role" = 'admin'
---
  def self.map_for(role)
    where(role: role).pluck(:page_key, :allowed).to_h

SELECT "role_permissions"."page_key" FROM "role_permissions" WHERE "role_permissions"."role" = 'manager'
---
  def self.ensure_defaults!(role)
    existing = where(role: role).pluck(:page_key)

SELECT 1 AS one FROM "system_roles" WHERE "system_roles"."name" = 'mesadepartes' LIMIT 1
---
  def role_must_exist
    return if role.blank?
    unless SystemRole.where(name: role).exists?