app/models/system_role.rb

SELECT 1 AS one FROM "users" WHERE "users"."role" = 'mesadepartes' LIMIT 1
---
  def deletable? = !system? && User.where(role: name).none?