app/models/user.rb

  def role_must_exist
    return if role.blank?
    unless SystemRole.where(name: role).exists?
---
SELECT 1 AS one FROM "system_roles" WHERE "system_roles"."name" = 'mesadepartes' LIMIT 1