app/models/virtual_submission.rb

  def generate_tracking_number
    return if tracking_number.present?
    loop do
      num = "VT-#{Time.current.year}-#{SecureRandom.random_number(9_999_999).to_s.rjust(7, '0')}"
      self.tracking_number = num
      break unless VirtualSubmission.exists?(tracking_number: num)
---
SELECT 1 AS one FROM "virtual_submissions" WHERE "virtual_submissions"."tracking_number" = 'VT-2026-1084364' LIMIT 1