app/views/api/v1/documents/_document.json.jbuilder

INSERT INTO "documents" ("access_level", "area_id", "attachment_checksum", "author_initials", "created_at", "created_by_id", "direction", "document_number", "document_type_id", "due_date", "folio_count", "observations", "outside_hours", "priority", "received_at", "recipient", "reference_number", "requires_response", "sender", "status", "subject", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22) RETURNING "id"
---
json.created_by do
  json.extract! document.created_by, :id, :nombre, :apellido, :email